     D A10_A7          C                   ''''
     D A10_A8          C                   ''''''
      *
     C     A10_A7        DSPLY
     C     A10_A8        DSPLY
      *
     C                   SETON                                          LR