     FADD01V    CF   E             WORKSTN
     C     PGMCTL        DOWEQ     0
     C                   EXFMT     FMT01
     C                   EVAL      RESULT=A+B
     C                   ENDDO
     C                   SETON                                          LR
