     FTRIM01V   CF   E             WORKSTN
     C     PGMCTL        DOWEQ     0
     C                   EXFMT     FMT01
     C                   EVAL      TRM=%TRIM(STR)
     C                   ENDDO
     C                   SETON                                          LR